In [64]:
import pandas as pd

In [65]:
#Information about the data
info = pd.read_csv('../data/raw/u.info', sep=" ", header=None)
info.columns=['Counts', 'Type']
info

   Counts     Type
0     943    users
1    1682    items
2  100000  ratings

In [77]:
#Types of genres
genre = pd.read_csv('../data/raw/u.genre',sep="|",encoding='latin-1', header=None)
genre.columns=['Genre', 'Number']
genre.drop(index=0, axis=1, inplace=True)
genre_list = list(genre['Genre'])
genre_list

['Action',
 'Adventure',
 'Animation',
 "Children's",
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Fantasy',
 'Film-Noir',
 'Horror',
 'Musical',
 'Mystery',
 'Romance',
 'Sci-Fi',
 'Thriller',
 'War',
 'Western']

In [78]:
#Types of occupations
occupation = pd.read_csv('../data/raw/u.occupation', sep="|", encoding='latin-1', header=None)
occupation.columns = ['Occupations']
occupation_list = list(occupation['Occupations'])
occupation_list

['administrator',
 'artist',
 'doctor',
 'educator',
 'engineer',
 'entertainment',
 'executive',
 'healthcare',
 'homemaker',
 'lawyer',
 'librarian',
 'marketing',
 'none',
 'other',
 'programmer',
 'retired',
 'salesman',
 'scientist',
 'student',
 'technician',
 'writer']

In [88]:
#Ratings data
data = pd.read_csv('../data/raw/u.data', sep="\t", header=None)
data.columns = ['user_id', 'movie_id', 'rating', 'timestamp']
data.head()

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [91]:
#user info
user = pd.read_csv('../data/raw/u.user', sep="|", header=None)
user.columns=['user_id','age', 'gender', 'occupation', 'zip']
user

     user_id  age gender     occupation    zip
0          1   24      M     technician  85711
1          2   53      F          other  94043
2          3   23      M         writer  32067
3          4   24      M     technician  43537
4          5   33      F          other  15213
..       ...  ...    ...            ...    ...
938      939   26      F        student  33319
939      940   32      M  administrator  02215
940      941   20      M        student  97229
941      942   48      F      librarian  78209
942      943   22      M        student  77841

[943 rows x 5 columns]

In [92]:
#Movies data
item = pd.read_csv('../data/raw/u.item', sep="|", encoding='latin-1', header=None)
item.columns = ['movie id', 'movie title' ,'release date','video release date', 'IMDb URL', 'unknown', 'Action', 
                'Adventure', 'Animation', 'Children\'s', 'Comedy', 'Crime', 'Documentary', 'Drama', 'Fantasy', 'Film-Noir', 
                'Horror', 'Musical', 'Mystery', 'Romance', 'Sci-Fi', 'Thriller', 'War', 'Western']
item.head()

,movie id,movie title,release date,video release date,IMDb URL,unknown,Action,Adventure,Animation,Children's,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0